CSI API ETABS v1
eMatTypeRebar Enumeration
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public enum eMatTypeRebar
Public Enumeration eMatTypeRebar
Dim instance As eMatTypeRebar
public enum class eMatTypeRebar
type eMatTypeRebar
Members
Member name | Value | Description
ASTM_A615Gr40 | 1
ASTM_A615Gr60 | 2
ASTM_A615Gr75 | 3
ASTM_A706 | 4
Chinese_HPB235 | 5
Chinese_HRB335 | 6
Chinese_HRB400 | 7
Indian_Mild250 | 8
Indian_HYSD415 | 9
Indian_HYSD500 | 10
Indian_HYSD550 | 11
See Also
Reference
ETABSv1 Namespace